# ИСПОЛЬЗОВАТЬ везде: PEP 8 рекомендует добавлять пробелы вокруг бинарных операторов
first_name = input('Введите имя: ')
last_name = input('Введите фамилию: ')
age = int(input('Введите год рождения: '))
print(last_name + ' ' + first_name + ', ' + str(2023 - age))


# Введите имя: Владимир
# Введите фамилию: Цыбровский
# Введите год рождения: 2000
# Цыбровский Владимир, 23


# КОММЕНТАРИЙ: PEP 8 — сборник рекомендаций по стилистическому оформлению Python кода — их стоит использовать для большего удобства чтения своего и чужого кода: https://peps.python.org/pep-0008/

